# JSON to CSV the right way

In [2]:
import pandas as pd

In [4]:
#____________________________________________________________________ SIMPLE JSON AND LIST
simple_json = {
    'name': 'David',
    'city': 'London',
    'income': 80000,
}

simple_json_2 = {
    'name': 'Taylor',
    'city': 'Chicago',
    'income': 120000,
}

simple_json_list = [
    simple_json, 
    simple_json_2

]

#____________________________________________________________________ MULTIPLE LEVEL JSON AND LIST
multiple_level_json = {
    'name': 'David',
    'city': 'London',
    'income': 80000,
    'skills': {
        'python': 'advanced',
        'SQL': 'advanced',
        'GCP': 'mid'
    },
    'roles': {
        "project manager":False,
        "data engineer":False,
        "data scientist":True,
        "data analyst":False
        }
    }

multiple_level_json_2 = {
    'name': 'Taylor',
    'city': 'Chicago',
    'income': 120000,
    'skills': {
        'python': 'mid',
        'SQL': 'advanced',
        'GCP': 'beginner'
    },
    'roles': {
        "project manager":False,
        "data engineer":False,
        "data scientist":False,
        "data analyst":True
        }
    }


multiple_level_json_list = [
    multiple_level_json, 
    multiple_level_json_2

]

#____________________________________________________________________ NESTED LEVELS JSON AND LIST

nested_levels_json = {
    'name': 'David',
    'city': 'London',
    'income': 80000,
    'skills': {
        'python': 'advanced',
        'SQL': 'advanced',
        'GCP': 'mid'
    },
    'roles': {
        "project manager":False,
        "data engineer":False,
        "data scientist":True,
        "data analyst":False,
        },
    'working experience':{
        'HP':{
            'data analyst': 16,
            'data scientist': 10
        },
        'Deloitte':{
            'intern':12,
            'junior data analyst': 6
        }
    }
}


nested_levels_json_2 = {
    'name': 'Taylor',
    'city': 'Chicago',
    'income': 120000,
    'skills': {
        'python': 'mid',
        'SQL': 'advanced',
        'GCP': 'beginner'
    },
    'roles': {
        "project manager":False,
        "data engineer":False,
        "data scientist":False,
        "data analyst":True
        },
    'working experience':{
        'Samsung':{
            'data analyst': 9,
        },
        'Google':{
            'intern':5,
            'junior data analyst': 20
        }
    }
}

nested_level_json_list = [
    nested_levels_json, 
    nested_levels_json_2

]

## Converting a simple JSON
### A single dictionary

In [3]:
pd.json_normalize(simple_json)

    name    city  income
0  David  London   80000

### A list of dictionaries

In [5]:
pd.json_normalize(simple_json_list)

     name     city  income
0   David   London   80000
1  Taylor  Chicago  120000

## Converting a JSON with multiple levels
### A single dictionary

In [6]:
pd.json_normalize(multiple_level_json)

,name,city,income,skills.python,skills.SQL,skills.GCP,roles.project manager,roles.data engineer,roles.data scientist,roles.data analyst
0,David,London,80000,advanced,advanced,mid,False,False,True,False

In [14]:
# We can use the max_level argument to define our maximum level
pd.json_normalize(multiple_level_json, max_level=2)

,name,city,income,skills.python,skills.SQL,skills.GCP,roles.project manager,roles.data engineer,roles.data scientist,roles.data analyst
0,David,London,80000,advanced,advanced,mid,False,False,True,False

### A list of dictionaries

In [9]:
pd.json_normalize(multiple_level_json_list)

,name,city,income,skills.python,skills.SQL,skills.GCP,roles.project manager,roles.data engineer,roles.data scientist,roles.data analyst
0,David,London,80000,advanced,advanced,mid,False,False,True,False
1,Taylor,Chicago,120000,mid,advanced,beginner,False,False,False,True

## Converting a JSON with nested lists
### A single dictionary

In [10]:
pd.json_normalize(nested_levels_json)

,name,city,income,skills.python,skills.SQL,skills.GCP,roles.project manager,roles.data engineer,roles.data scientist,roles.data analyst,working experience.HP.data analyst,working experience.HP.data scientist,working experience.Deloitte.intern,working experience.Deloitte.junior data analyst
0,David,London,80000,advanced,advanced,mid,False,False,True,False,16,10,12,6

### A list of dictionaries

In [11]:
pd.json_normalize(nested_level_json_list)

,name,city,income,skills.python,skills.SQL,skills.GCP,roles.project manager,roles.data engineer,roles.data scientist,roles.data analyst,working experience.HP.data analyst,working experience.HP.data scientist,working experience.Deloitte.intern,working experience.Deloitte.junior data analyst,working experience.Samsung.data analyst,working experience.Google.intern,working experience.Google.junior data analyst
0,David,London,80000,advanced,advanced,mid,False,False,True,False,16.0,10.0,12.0,6.0,NaN,NaN,NaN
1,Taylor,Chicago,120000,mid,advanced,beginner,False,False,False,True,NaN,NaN,NaN,NaN,9.0,5.0,20.0

pd.json_normalize(nested_levels_json)

# Assessing KeyErrors
Avoid getting an error whenever a key does not exist in our JSON.